# IsDuctTypeId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Duct..::..IsDuctTypeId Method
Duct Class See Also
---
Checks if given type is valid duct type.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static bool IsDuctTypeId(
	Document document,
	ElementId ductTypeId
)
```

Visual Basic
---
```text
Public Shared Function IsDuctTypeId ( _
	document As Document, _
	ductTypeId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsDuctTypeId(
	Document^ document,
	ElementId^ ductTypeId
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
ductTypeId
    Type: Autodesk.Revit.DB..::..ElementId ElementId of the duct type to check.
# ### Return Value
True if duct type can used for this duct, false otherwise.
# Remarks
A type is valid for duct if it can be used to the duct element.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Duct Class
Autodesk.Revit.DB.Mechanical Namespace